import pytest
import datetime

from func.class_ import BankOperation




def tests_class_bankoperation():
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").format_date() == "26.08.2019"
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").coding_from_() == "Счет **9589"
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").coding_to() == "Maestro 1596 83** **** 5199"
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").send_amount() == "31957.58 руб."
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").format_datatime() == datetime.datetime(2019, 8, 26, 10, 50, 58)
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").operation_verification() == True
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199").coding_from_() == None
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Maestro 1596837868705199").coding_from_() == "Maestro 1596 83** **** 5199"
    assert BankOperation(441945886, "EXECUTED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Счет 64686473678894779589", "Счет 64686473678894779589").coding_to() == "Счет **9589"
    assert BankOperation(441945886, "CANCELED", "2019-08-26T10:50:58.294041", "31957.58", "руб.", "Перевод организации",
                         "Maestro 1596837868705199", "Счет 64686473678894779589").operation_verification() == False

